Repository: chetirechasa/linux-app-dev
Catalog: 12_InstallPackaging/po/*.po
Languages: ru

source: Usage: login-gen [OPTIONS] USERNAME
ru: Использование: login-gen [ОПЦИИ] ИМЯ ПОЛЬЗОВАТЕЛЯ

source: Generate system login in format: system-<username>-<random_number>
ru: Генерирует логин системы в формате: system-<username>-<random_number>

source: Options:
ru: Опции:

source: -h, --help Show this help message
ru: -h, --help Показать эту помощь

source: -v, --version Show version information
ru: -v, --version Показать информацию о версии

source: Username must contain only latin letters
ru: Имя пользователя должно состоять только из латинских букв

source: Example: login-gen Ivan
ru: Пример: login-gen Ivan

source: System login generator
ru: Генератор системного логина

source: Error: Username is required
ru: Ошибка: требуется имя пользователя

source: Error: Username must contain only Latin letters
ru: Ошибка: имя пользователя может содержать только латинские буквы

source: Error: Failed to generate login
ru: Ошибка: Не получилось сгенерировать логин
